###################################################################

# Created by write_script -format dctcl on Sat Feb 27 01:36:04 2021

###################################################################

# Set the current_design #
current_design NFC

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max slow -max_library slow\
                         -min fast -min_library fast
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports done]
set_load -pin_load 1 [get_ports M_RW]
set_load -pin_load 1 [get_ports {M_A[6]}]
set_load -pin_load 1 [get_ports {M_A[5]}]
set_load -pin_load 1 [get_ports {M_A[4]}]
set_load -pin_load 1 [get_ports {M_A[3]}]
set_load -pin_load 1 [get_ports {M_A[2]}]
set_load -pin_load 1 [get_ports {M_A[1]}]
set_load -pin_load 1 [get_ports {M_A[0]}]
set_load -pin_load 1 [get_ports {M_D[7]}]
set_load -pin_load 1 [get_ports {M_D[6]}]
set_load -pin_load 1 [get_ports {M_D[5]}]
set_load -pin_load 1 [get_ports {M_D[4]}]
set_load -pin_load 1 [get_ports {M_D[3]}]
set_load -pin_load 1 [get_ports {M_D[2]}]
set_load -pin_load 1 [get_ports {M_D[1]}]
set_load -pin_load 1 [get_ports {M_D[0]}]
set_load -pin_load 1 [get_ports {F_IO[7]}]
set_load -pin_load 1 [get_ports {F_IO[6]}]
set_load -pin_load 1 [get_ports {F_IO[5]}]
set_load -pin_load 1 [get_ports {F_IO[4]}]
set_load -pin_load 1 [get_ports {F_IO[3]}]
set_load -pin_load 1 [get_ports {F_IO[2]}]
set_load -pin_load 1 [get_ports {F_IO[1]}]
set_load -pin_load 1 [get_ports {F_IO[0]}]
set_load -pin_load 1 [get_ports F_CLE]
set_load -pin_load 1 [get_ports F_ALE]
set_load -pin_load 1 [get_ports F_REN]
set_load -pin_load 1 [get_ports F_WEN]
create_clock [get_ports clk]  -period 19  -waveform {0 9.5}
set_clock_latency 1  [get_clocks clk]
set_clock_uncertainty 1  [get_clocks clk]
set_dont_touch_network [get_clocks clk]
set_fix_hold [get_clocks clk]
set_min_delay 1  -from [get_ports F_RB]
set_input_delay -clock clk  1  [get_ports rst]
set_input_delay -clock clk  9  [get_ports {cmd[32]}]
set_input_delay -clock clk  9  [get_ports {cmd[31]}]
set_input_delay -clock clk  9  [get_ports {cmd[30]}]
set_input_delay -clock clk  9  [get_ports {cmd[29]}]
set_input_delay -clock clk  9  [get_ports {cmd[28]}]
set_input_delay -clock clk  9  [get_ports {cmd[27]}]
set_input_delay -clock clk  9  [get_ports {cmd[26]}]
set_input_delay -clock clk  9  [get_ports {cmd[25]}]
set_input_delay -clock clk  9  [get_ports {cmd[24]}]
set_input_delay -clock clk  9  [get_ports {cmd[23]}]
set_input_delay -clock clk  9  [get_ports {cmd[22]}]
set_input_delay -clock clk  9  [get_ports {cmd[21]}]
set_input_delay -clock clk  9  [get_ports {cmd[20]}]
set_input_delay -clock clk  9  [get_ports {cmd[19]}]
set_input_delay -clock clk  9  [get_ports {cmd[18]}]
set_input_delay -clock clk  9  [get_ports {cmd[17]}]
set_input_delay -clock clk  9  [get_ports {cmd[16]}]
set_input_delay -clock clk  9  [get_ports {cmd[15]}]
set_input_delay -clock clk  9  [get_ports {cmd[14]}]
set_input_delay -clock clk  9  [get_ports {cmd[13]}]
set_input_delay -clock clk  9  [get_ports {cmd[12]}]
set_input_delay -clock clk  9  [get_ports {cmd[11]}]
set_input_delay -clock clk  9  [get_ports {cmd[10]}]
set_input_delay -clock clk  9  [get_ports {cmd[9]}]
set_input_delay -clock clk  9  [get_ports {cmd[8]}]
set_input_delay -clock clk  9  [get_ports {cmd[7]}]
set_input_delay -clock clk  9  [get_ports {cmd[6]}]
set_input_delay -clock clk  9  [get_ports {cmd[5]}]
set_input_delay -clock clk  9  [get_ports {cmd[4]}]
set_input_delay -clock clk  9  [get_ports {cmd[3]}]
set_input_delay -clock clk  9  [get_ports {cmd[2]}]
set_input_delay -clock clk  9  [get_ports {cmd[1]}]
set_input_delay -clock clk  9  [get_ports {cmd[0]}]
set_input_delay -clock clk  1  [get_ports {M_D[7]}]
set_input_delay -clock clk  1  [get_ports {M_D[6]}]
set_input_delay -clock clk  1  [get_ports {M_D[5]}]
set_input_delay -clock clk  1  [get_ports {M_D[4]}]
set_input_delay -clock clk  1  [get_ports {M_D[3]}]
set_input_delay -clock clk  1  [get_ports {M_D[2]}]
set_input_delay -clock clk  1  [get_ports {M_D[1]}]
set_input_delay -clock clk  1  [get_ports {M_D[0]}]
set_input_delay -clock clk  4  [get_ports {F_IO[7]}]
set_input_delay -clock clk  4  [get_ports {F_IO[6]}]
set_input_delay -clock clk  4  [get_ports {F_IO[5]}]
set_input_delay -clock clk  4  [get_ports {F_IO[4]}]
set_input_delay -clock clk  4  [get_ports {F_IO[3]}]
set_input_delay -clock clk  4  [get_ports {F_IO[2]}]
set_input_delay -clock clk  4  [get_ports {F_IO[1]}]
set_input_delay -clock clk  4  [get_ports {F_IO[0]}]
set_input_delay -clock clk  0  [get_ports F_RB]
set_output_delay -clock clk  1  [get_ports {M_D[7]}]
set_output_delay -clock clk  1  [get_ports {M_D[6]}]
set_output_delay -clock clk  1  [get_ports {M_D[5]}]
set_output_delay -clock clk  1  [get_ports {M_D[4]}]
set_output_delay -clock clk  1  [get_ports {M_D[3]}]
set_output_delay -clock clk  1  [get_ports {M_D[2]}]
set_output_delay -clock clk  1  [get_ports {M_D[1]}]
set_output_delay -clock clk  1  [get_ports {M_D[0]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[7]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[7]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[6]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[6]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[5]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[5]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[4]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[4]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[3]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[3]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[2]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[2]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[1]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[1]}]
set_output_delay -clock clk  -max 2  [get_ports {F_IO[0]}]
set_output_delay -clock clk  -min -1  [get_ports {F_IO[0]}]
set_output_delay -clock clk  1  [get_ports done]
set_output_delay -clock clk  1  [get_ports M_RW]
set_output_delay -clock clk  1  [get_ports {M_A[6]}]
set_output_delay -clock clk  1  [get_ports {M_A[5]}]
set_output_delay -clock clk  1  [get_ports {M_A[4]}]
set_output_delay -clock clk  1  [get_ports {M_A[3]}]
set_output_delay -clock clk  1  [get_ports {M_A[2]}]
set_output_delay -clock clk  1  [get_ports {M_A[1]}]
set_output_delay -clock clk  1  [get_ports {M_A[0]}]
set_output_delay -clock clk  -min -1  [get_ports F_CLE]
set_output_delay -clock clk  -min -1  [get_ports F_ALE]
set_output_delay -clock clk  -max 2  [get_ports F_REN]
set_output_delay -clock clk  -max 2  [get_ports F_WEN]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst]
set_drive 1  [get_ports {cmd[32]}]
set_drive 1  [get_ports {cmd[31]}]
set_drive 1  [get_ports {cmd[30]}]
set_drive 1  [get_ports {cmd[29]}]
set_drive 1  [get_ports {cmd[28]}]
set_drive 1  [get_ports {cmd[27]}]
set_drive 1  [get_ports {cmd[26]}]
set_drive 1  [get_ports {cmd[25]}]
set_drive 1  [get_ports {cmd[24]}]
set_drive 1  [get_ports {cmd[23]}]
set_drive 1  [get_ports {cmd[22]}]
set_drive 1  [get_ports {cmd[21]}]
set_drive 1  [get_ports {cmd[20]}]
set_drive 1  [get_ports {cmd[19]}]
set_drive 1  [get_ports {cmd[18]}]
set_drive 1  [get_ports {cmd[17]}]
set_drive 1  [get_ports {cmd[16]}]
set_drive 1  [get_ports {cmd[15]}]
set_drive 1  [get_ports {cmd[14]}]
set_drive 1  [get_ports {cmd[13]}]
set_drive 1  [get_ports {cmd[12]}]
set_drive 1  [get_ports {cmd[11]}]
set_drive 1  [get_ports {cmd[10]}]
set_drive 1  [get_ports {cmd[9]}]
set_drive 1  [get_ports {cmd[8]}]
set_drive 1  [get_ports {cmd[7]}]
set_drive 1  [get_ports {cmd[6]}]
set_drive 1  [get_ports {cmd[5]}]
set_drive 1  [get_ports {cmd[4]}]
set_drive 1  [get_ports {cmd[3]}]
set_drive 1  [get_ports {cmd[2]}]
set_drive 1  [get_ports {cmd[1]}]
set_drive 1  [get_ports {cmd[0]}]
set_drive 1  [get_ports {M_D[7]}]
set_drive 1  [get_ports {M_D[6]}]
set_drive 1  [get_ports {M_D[5]}]
set_drive 1  [get_ports {M_D[4]}]
set_drive 1  [get_ports {M_D[3]}]
set_drive 1  [get_ports {M_D[2]}]
set_drive 1  [get_ports {M_D[1]}]
set_drive 1  [get_ports {M_D[0]}]
set_drive 1  [get_ports {F_IO[7]}]
set_drive 1  [get_ports {F_IO[6]}]
set_drive 1  [get_ports {F_IO[5]}]
set_drive 1  [get_ports {F_IO[4]}]
set_drive 1  [get_ports {F_IO[3]}]
set_drive 1  [get_ports {F_IO[2]}]
set_drive 1  [get_ports {F_IO[1]}]
set_drive 1  [get_ports {F_IO[0]}]
set_drive 1  [get_ports F_RB]
set compile_inbound_cell_optimization false
set compile_inbound_max_cell_percentage 10.0
1
